In [1]:
import numpy as np
import pandas as pd

## Assigning a NaN value
If you need to specifically assign a NaN value to an element in a data structure, you can
use the np.NaN (or np.nan) value of the NumPy library.

In [2]:
ser = pd.Series([0,1,2,np.NaN,9],
... index=['red','blue','yellow','white','green'])

In [3]:
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [5]:
ser['white'] = None

In [6]:
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

## Filtering out NaN values

In [7]:
# Using the dropna() function drops the NaN values
ser.dropna()

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [8]:
# Another method
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [10]:
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,np.nan,np.nan],[2,np.nan,5]],
... index = ['blue','green','red'],
... columns = ['ball','mug','pen'])

In [11]:
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [12]:
frame3.dropna()

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [14]:
# This tells the dropna funciton to drop the row or column in which all the elements are NaN
frame3.dropna(how='all')

      ball  mug  pen
blue   6.0  NaN  6.0
red    2.0  NaN  5.0

## Filling in NaN occurences

In [15]:
frame3.fillna(0)

       ball  mug  pen
blue    6.0  0.0  6.0
green   0.0  0.0  0.0
red     2.0  0.0  5.0

Or you can replace NaN with different values depending on the column, specifying
one by one the indexes and the associated values.

In [16]:
frame3.fillna({'ball':1,'mug':0,'pen':99})

       ball  mug   pen
blue    6.0  0.0   6.0
green   1.0  0.0  99.0
red     2.0  0.0   5.0